-- Заполнение таблиц

INSERT INTO cmp.client (ФИО, Телефон, Номер_паспорта, Адрес) VALUES
('Иванов Иван Иванович', '71232343445', 112233, 'ул. Ленина, д.1'),
('Оспанов Ален Оспанович', '72341236745', 223344, 'ул. Пушкина, д.2'),
('Долта Артем Дотадвачев', '74562317867', 334455, 'ул. Невского, д.5'),
('Нам Илья Вашевич', '76783451221', 445566, 'ул. Гоголя, д.1'),
('Хакин Вальтер Карабахович', '77895673432', 556677, 'ул. Ленина, д.1'),
('Каныбеков Канатбек Веревкович', '73456789012', 667788, 'пр. Мира, д.12'),
('Исабеков Аян Базавич', '73832927423', 778899, 'ул. Советская, д.1'),
('Шпилевой Денис Делович','72344643718', 889900, 'ул. Шапена, д.9'),
('Ушуров Эмир Машинович', '75843732938', 990011, 'пр. Победа, д.45'),
('Есерпеков Тамирлан Фупмесович', '73932128989', 881122, 'ул. Королева, д.6');

INSERT INTO cmp.employee (id_number, ФИО, Телефон, Отдел, Зарплата) VALUES
(1, 'Сидоров Сидор Сидорович', '34567890123', 'Тех-поддрежка', 50000),
(2, 'Могилев Георгий Русскович', '34567890123', 'Отдел продаж', 70000),
(3, 'Долгополый Николай Долгопруднович', '34567890123', 'Отдел маркетинга', 65000),
(4, 'Лутфулаев Сардор Пловович', '34567890123', 'Отдел маркетинга',65000),
(5, 'Ткачик Андрей Донбасович','34567890123', 'IT сектор', 80000),
(6, 'Косенко Иван Картошкович', '34567890123', 'IT сектор', 80000),
(7, 'Баймурзинов Даниэль Рыжевич', '34567890123', 'Отдел работ', 68000),
(8, 'Рубанов Всеволод Левакович', '34567890123', 'Отдел работ', 68000),
(9, 'Чубарь Антон Ребенокович', '34567890123', 'Отдел продаж', 70000),
(10, 'Ходжиматов Далер Чернович','34567890123', 'Тех-поддрежка', 50000);

INSERT INTO cmp."order" (Заказчик, Исполнитель, Дата_заказа, Цена, Адрес, Дата_исполнения, Код_услуги, Номер_заказа) VALUES
(334455, 7, '2022-01-01', 1000.0, 'ул. Невского, д.5', '2022-01-03', 101, 1),
(881122, 8, '2022-02-03', 1800.0, 'ул. Королева, д.6', '2022-02-10', 102, 2),
(223344, 7, '2022-07-21', 1200.0, 'ул. Пушкина, д.2', '2022-07-26', 101, 3),
(556677, 8, '2021-12-23', 500.0, 'ул. Ленина, д.1', '2021-12-30', 104, 4),
(889900, 7, '2023-02-01', 300.0, 'ул. Шапена, д.9', '2023-02-03', 101, 5),
(881122, 8, '2022-11-13', 2304.0, 'ул. Королева, д.6', '2022-11-14', 103, 6),
(778899, 7, '2021-01-01', 3045.8, 'ул. Советская, д.1', '2021-01-03', 101, 7),
(667788, 8, '2020-02-03', 1800.45, 'пр. Мира, д.12', '2020-02-10', 102, 8),
(445566, 7, '2022-06-03', 30.46, 'ул. Гоголя, д.1', '2022-06-03', 103, 9),
(990011, 8, '2022-04-23', 1800.0, 'пр. Победа, д.45', '2022-04-25', 104, 10);

INSERT INTO cmp.internet (Тариф, Скорость, Интернет_провайдер, Цена, Код_услуги_интернет) VALUES
('Базовый', 50, 'Ростелеком', 500.0, 101),
('Продвинутый', 100, 'Мегафон', 1000.0, 102),
('VIP', 150, 'КазахТелеКом', 2500.0, 103),
('Безлимит', 200, 'Star-Link', 4000.0, 104);

INSERT INTO cmp.tv (Тариф, Количество_каналов, Цена, Код_услуги_телевизор) VALUES 
('Стандартный', 100, 500.0, 201),
('Расширенный', 200, 1000.0, 202),
('Евро+', 50, 300.0, 203),
('Азия+', 50, 300.0, 204);

INSERT INTO cmp.incountry (Город, Цена) VALUES
('Санкт-Петербург', 200.0),
('Владивосток', 300.0),
('Новгород', 150.0),
('Самара', 200.0),
('Омск', 350.0),
('Томск', 350.0);

INSERT INTO cmp.outcountry (Страна, Цена) VALUES
('Казахстан',1000.0),
('Китай', 2000.0),
('Германия',3500.0),
('США',6000.0),
('Япония', 3000.0),
('Бразилия', 5000.0);

INSERT INTO cmp.phone (Код_услуги_телефон, Цена)
SELECT HASH(CONCAT_WS('_', cmp.incountry.Город, cmp.outcountry.Страна)), cmp.incountry.Цена + cmp.outcountry.Цена
FROM cmp.incountry
JOIN cmp.outcountry ON 1=1;

-- CRUD-запросы

-- CREATE:
INSERT INTO cmp.employee (id_number, ФИО, Телефон, Отдел, Зарплата) VALUES
(11, 'Леннон Джон Уинсто', '34767890123', 'Тех-поддрежка', 50000);
INSERT INTO cmp.outcountry (Страна, Цена) VALUES
('Казахстан',1000.0),

-- READ:
SELECT * FROM cmp.client;
SELECT ФИО, Номер_паспорта, Адрес FROM cmp.client WHERE Адрес = 'ул. Ленина, д.1';

-- UPDATE:
UPDATE cmp.client SET Телефон = '12223334455' WHERE Телефон = '72341236745';
UPDATE cmp.employee SET Зарплата = 80000 WHERE id_number = 2;
UPDATE cmp.employee SET Зарплата = 90000 WHERE id_number = 5;

-- DELETE:
DELETE FROM cmp.client WHERE Номер_паспорта = 112233;
DELETE FROM cmp.employee WHERE Зарплата < 60000;
DELETE FROM cmp."order" WHERE EXTRACT(YEAR FROM Дата_исполнения) = 2020;

-- Осмысленные запросы

SELECT * FROM cmp.employee 
ORDER BY Зарплата DESC;

SELECT
	ФИО,
	Адрес
FROM cmp.client
WHERE SUBSTRING(Адрес, 1, 10) = 'ул. Ленина';

SELECT
	ROW_NUMBER() OVER (PARTITION BY Отдел ORDER BY Зарплата DESC) AS Рейтинг,
	ФИО,
	Отдел,
	Зарплата 
FROM cmp.employee;

SELECT 
	Номер_заказа,
	Цена
FROM cmp."order"
WHERE Цена > 2000.0
ORDER BY Дата_заказа DESC;


SELECT
	Заказчик,
	Исполнитель
FROM cmp."order"
WHERE EXTRACT(YEAR FROM Дата_исполнения) = 2021;

SELECT
	id_number,
	ФИО
FROM cmp.employee
WHERE Отдел = 'IT сектор';
