-- Заполнение таблиц

INSERT INTO cmp.client ("ФИО", "Телефон", "Номер_паспорта", "Адрес") VALUES
('Иванов Иван Иванович', '71232343445', 112233, 'ул. Ленина, д.1'),
('Оспанов Ален Оспанович', '72341236745', 223344, 'ул. Пушкина, д.2'),
('Долта Артем Дотадвачев', '74562317867', 334455, 'ул. Невского, д.5'),
('Нам Илья Вашевич', '76783451221', 445566, 'ул. Гоголя, д.1'),
('Хакин Вальтер Карабахович', '77895673432', 556677, 'ул. Ленина, д.1'),
('Каныбеков Канатбек Веревкович', '73456789012', 667788, 'пр. Мира, д.12'),
('Исабеков Аян Базавич', '73832927423', 778899, 'ул. Советская, д.1'),
('Шпилевой Денис Делович','72344643718', 889900, 'ул. Шапена, д.9'),
('Ушуров Эмир Машинович', '75843732938', 990011, 'пр. Победа, д.45'),
('Есерпеков Тамирлан Фупмесович', '73932128989', 881122, 'ул. Королева, д.6');

INSERT INTO cmp.employee ("id_number", "ФИО", "Телефон", "Отдел", "Зарплата") VALUES
(1, 'Сидоров Сидор Сидорович', '34567890123', 'Тех-поддрежка', 50000),
(2, 'Могилев Георгий Русскович', '34567890123', 'Отдел продаж', 70000),
(3, 'Долгополый Николай Долгопруднович', '34567890123', 'Отдел маркетинга', 65000),
(4, 'Лутфулаев Сардор Пловович', '34567890123', 'Отдел маркетинга',65000),
(5, 'Ткачик Андрей Донбасович','34567890123', 'IT сектор', 80000),
(6, 'Косенко Иван Картошкович', '34567890123', 'IT сектор', 80000),
(7, 'Баймурзинов Даниэль Рыжевич', '34567890123', 'Отдел работ', 68000),
(8, 'Рубанов Всеволод Левакович', '34567890123', 'Отдел работ', 68000),
(9, 'Чубарь Антон Ребенокович', '34567890123', 'Отдел продаж', 70000),
(10, 'Ходжиматов Далер Чернович','34567890123', 'Тех-поддрежка', 50000);

INSERT INTO cmp.services ("Код_услуги", "Цена", "Название")
SELECT
    CONCAT(cmp.internet.Код_услуги_интернет, cmp.tv.Код_услуги_телевизор, cmp.phone.Код_услуги_телефон),
    cmp.internet."Цена" + cmp.tv."Цена" + cmp.phone."Цена",
    CONCAT(cmp.internet.Тариф, ' + ', cmp.tv.Тариф, ' + ', cmp.phone.Тариф)
FROM cmp.internet
JOIN cmp.tv ON 1 = 1
JOIN cmp.phone ON 1 = 1;

INSERT INTO cmp."order" ("Заказчик", "Исполнитель", "Дата_заказа", "Цена", "Адрес", "Дата_исполнения", "Код_услуги", "Номер_заказа") VALUES
(334455, 7, '2022-01-01', 1000.0, 'ул. Невского, д.5', '2022-01-03', '100200038', 1),
(881122, 8, '2022-02-03', 1800.0, 'ул. Королева, д.6', '2022-02-10', '103200135', 2),
(223344, 7, '2022-07-21', 1200.0, 'ул. Пушкина, д.2', '2022-07-26', '108204730', 3),
(556677, 8, '2021-12-23', 500.0, 'ул. Ленина, д.1', '2021-12-30', '100203731', 4),
(889900, 7, '2023-02-01', 300.0, 'ул. Шапена, д.9', '2023-02-03', '104200134', 5),
(881122, 8, '2022-11-13', 2304.0, 'ул. Королева, д.6', '2022-11-14', '1072039310', 6),
(778899, 7, '2021-01-01', 3045.8, 'ул. Советская, д.1', '2021-01-03', '1102021034', 7),
(667788, 8, '2020-02-03', 1800.45, 'пр. Мира, д.12', '2020-02-10', '1022058310', 8),
(445566, 7, '2022-06-03', 30.46, 'ул. Гоголя, д.1', '2022-06-03', '104206131', 9),
(990011, 8, '2022-04-23', 1800.0, 'пр. Победа, д.45', '2022-04-25', '109201537', 10);

INSERT INTO cmp.internet ("Тариф", "Скорость", "Интернет_провайдер", "Цена", "Код_услуги_интернет") VALUES
('<пусто>', 0, '<пусто>', 0.0, '100'),
('Базовый', 50, 'Ростелеком', 500.0, '101'),
('Продвинутый', 100, 'Мегафон', 1000.0, '102'),
('VIP', 150, 'КазахТелеКом', 2500.0, '103'),
('Безлимит', 200, 'Star-Link', 4000.0, '104'),
('Лютый', 350, 'КазахТелеКом', 500.0, '105'),
('Для игроманов', 240, 'Мегафон', 1000.0, '106'),
('Для пожилых', 10, 'МТС', 250.0, '107'),
('Для веселья', 420, 'Пентагон', 4020.0, '108'),
('УьтраГига +', 2500, 'Альфацентавра', 2500.0, '109'),
('МегаУлет-', 69, 'Star-Link', 690.0, '110');

INSERT INTO cmp.tv ("Тариф", "Количество_каналов", "Цена", "Код_услуги_телевизор") VALUES
('<пусто>', 0, 0.0, '200'),
('Стандартный', 100, 500.0, '201'),
('Расширенный', 200, 1000.0, '202'),
('Евро+', 50, 300.0, '203'),
('Пакет Семейный', 20, 130.0, '204'),
('Пакет Киноманов', 500, 1000.0, '205'),
('Расширенный++', 300, 800.0, '206'),
('Евро+', 50, 300.0, '207'),
('Азия+', 50, 300.0, '208'),
('Америка+', 50, 300.0, '209'),
('Марс+', 50, 300.0, '210');

INSERT INTO cmp.incountry ("Код", "Город", "Цена") VALUES
('30', '<пусто>', 0.0),
('31', 'Санкт-Петербург', 200.0),
('32', 'Владивосток', 300.0),
('33', 'Новгород', 150.0),
('34', 'Самара', 200.0),
('35', 'Омск', 350.0),
('36', 'Томск', 350.0),
('37', 'Киров', 150.0),
('38', 'Тюмень', 200.0),
('39', 'Астрахань', 350.0),
('310', 'Мурманск', 350.0);

INSERT INTO cmp.outcountry ("Код", "Страна", "Цена") VALUES
('0', '<пусто>', 0.0),
('1', 'Казахстан',1000.0),
('2', 'Китай', 2000.0),
('3', 'Германия',3500.0),
('4', 'США',6000.0),
('5', 'Япония', 3000.0),
('6', 'Бразилия', 5000.0),
('7', 'Филипины',3500.0),
('8', 'Канада',6000.0),
('9', 'Индия', 3000.0),
('10','ЮАР', 5000.0);

INSERT INTO cmp.phone ("Тариф", "Код_услуги_телефон", "Цена")
SELECT CONCAT(cmp.outcountry.Страна, ' + ',cmp.incountry.Город),
       CONCAT(cmp.outcountry.Код, cmp.incountry.Код),
       cmp.outcountry.Цена + cmp.incountry.Цена
FROM cmp.outcountry
JOIN cmp.incountry ON 1=1;
